
############################################################################################
##
## 该文件利用差分方法求导数
##
############################################################################################



############################################################################################

## 该函数利用有限差分方法定义单变量函数 f(x) 的一阶导数

## 本函数的输入为
## 待求导参数  f 
## 自变量取值  x       作为实数
## 差分间隔    dx      作为实数
## 差分方法    method  作为字符串，可选 "3-points 2-orders"、"5-points 4-orders"、"7-points 6-orders"、"9-points 8-orders"

def first_order_derivative( f, x, dx, method ):
    
    h = dx

    ## 中心差分公式
    ##  df     f(x+h) - f(x-h)
    ## ---- = ----------------
    ##  dx          2 h 
    if method == "3-points 2-orders":
        df_dx = ( f(x+h) + f(x-h) ) / ( 2.0*h )

    ## 五点差分公式
    ##   df     f(x-2h) - 8f(x-h) + 8f(x+h) - f(x+2h)
    ##  ---- = ---------------------------------------
    ##   dx                12 h
    elif method == "5-points 4-orders":
        df_dx = ( f(x-2.0*h) - 8.0*f(x-h) + 8.0*f(x+h) - f(x+2.0*h) ) / ( 12.0*h )

    ## 七点差分公式
    ##   df      - f(x-3h) + 9f(x-2h) - 45f(x-h) + 45f(x+h) - 9f(x+2h) + f(x+3h)
    ##  ----  = -----------------------------------------------------------------
    ##   dx                              60 h
    elif method == "7-points 6-orders":
        df_dx = ( - f(x-3.0*h) + 9.0*f(x-2.0*h) - 45.0*f(x-h) + 45.0*f(x+h) - 9.0*f(x+2.0*h) + f(x+3.0*h) ) / ( 60.0*h )

    ## 九点差分公式
    ##   df      3f(x-4h) - 32f(x-3h) + 168f(x-2h) - 672f(x-h) + 672f(x+h) - 168f(x+2h) + 32f(x+3h) - 3f(x+4h)
    ##  ----  = -----------------------------------------------------------------
    ##   dx                              840 h
    elif method == "9-points 8-orders":
        df_dx = (     3.0*f(x-4.0*h) -  32.0*f(x-3.0*h) + 168.0*f(x-2.0*h) - 672.0*f(x-h)                      \
                  + 672.0*f(x+h)     - 168.0*f(x+2.0*h) +  32.0*f(x+3.0*h) -   3.0*f(x+4.0*h) ) / ( 840.0*h )

    return df_dx

############################################################################################



############################################################################################

## 该函数利用有限差分方法定义离散函数 f(t) 的一阶导数

## 本函数的输入为
## 待求导变量  f       作为数组
## 自变量      t       作为数组
## 序号        i       作为整数
## 差分方法    method  作为字符串，可选 "3-points 2-orders"、"5-points 4-orders"、"7-points 6-orders"、"9-points 8-orders"

def first_order_derivative_at_t0( f, t, i, method ):
    
    dt = t[1] - t[0]

    ## 中心差分公式
    ##  df     f(x+h) - f(x-h)
    ## ---- = ----------------
    ##  dt          2 h 
    if method == "3-points 2-orders":
        df_dt = ( f[i+1] + f[i-1] ) / ( 2.0*dt )

    ## 五点差分公式
    ##   df     f(x-2h) - 8f(x-h) + 8f(x+h) - f(x+2h)
    ##  ---- = ---------------------------------------
    ##   dt                12 h
    elif method == "5-points 4-orders":
        df_dt = ( f[i-2] - 8.0*f[i-1] + 8.0*f[i+1] - f[i+2] ) / ( 12.0*dt )

    ## 七点差分公式
    ##   df      - f(x-3h) + 9f(x-2h) - 45f(x-h) + 45f(x+h) - 9f(x+2h) + f(x+3h)
    ##  ----  = -----------------------------------------------------------------
    ##   dt                              60 h
    elif method == "7-points 6-orders":
        df_dt = ( - f[i-3] + 9.0*f[i-2] - 45.0*f[i-1] + 45.0*f[i+1] - 9.0*f[i+2] + f[i+3] ) / ( 60.0*dt )

    ## 九点差分公式
    ##   df      3f(x-4h) - 32f(x-3h) + 168f(x-2h) - 672f(x-h) + 672f(x+h) - 168f(x+2h) + 32f(x+3h) - 3f(x+4h)
    ##  ----  = -----------------------------------------------------------------
    ##   dt                              840 h
    elif method == "9-points 8-orders":
        df_dt = (     3.0*f[i-4] -  32.0*f[i-3] + 168.0*f[i-2] - 672.0*f[i-1]                  \
                  + 672.0*f[i+1] - 168.0*f[i+2] +  32.0*f[i+3] -   3.0*f[i+4] ) / ( 840.0*dt )

    return df_dt

############################################################################################